#include <stdio.h>
 
int main() {
    int A[][3] = {1, 2, 3, 4, 5, 6, 7, 8, 9};
    int *p = A[0];
    printf("%d\n", p[2]);
    printf("---------\n");
    
    int (*pa)[3] = A;
    printf("%d\n", pa[0][2]);
    //Или так
    printf("%d\n", *(*( pa + 0 ) + 2));
    printf("---------\n");

    printf("%d\n", *(*( A + 1 ) + 2));
    return 0;
}
//Мы получили указатель на первую строку. Далее вывели третий элемент. Либо так - создать массив указателей на строки

/*
    OutPut:
    3
    ---------
    3
    3
    ---------
    6
*/
